In [1]:
%load_ext sql

In [ ]:
%sql mysql+pymysql://root:password@localhost:3306/md_water_services

'Connected: root@md_water_services'

1.ERD 

To integrate the auditor's report, we will need to access many of the tables in the database, so it is important to understand the database structure.
To do this we really need to understand the relationships first, so we know where to pull information from. Can you please get the ERD for the
md_water_services database? Spend a few minutes looking at the diagram.

![ERD](MdwaterservicesERD.png)

2. INTEGRATING AUDITOR'S REPORT

In [14]:
%%sql
-- Creating Auditor report table and loading the auditor report file
DROP TABLE IF EXISTS `auditor_report`;
CREATE TABLE `auditor_report` (
`location_id` VARCHAR(32),
`type_of_water_source` VARCHAR(64),
`true_water_source_score` int DEFAULT NULL,
`statements` VARCHAR(255)
);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.
0 rows affected.

[]

In [15]:
%%sql
-- Checking Auditor Report Table after importing CSV
SELECT 
*
FROM 
Auditor_report
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu34980', 'well', 1, "Residents admired the official's commitment to enhancing urban life, praising their cooperative and inclusive approach."),
 ('AkRu08112', 'well', 3, "Villagers spoke highly of the official's dedication and genuine interest in their lives, fostering a sense of belonging and appreciation."),
 ('AkLu02044', 'river', 0, "Villagers were touched by the official's interactions, noting their humility, strong work ethic, and respectful attitude."),
 ('AkHa00421', 'well', 3, "Villagers were moved by the official's visit, praising their hard work, humility, and the profound sense of connection they fostered."),
 ('SoRu35221', 'river', 0, "A photographer's lens captures the queue, though his own struggle for water is a hidden part of the story.")]


i)Is there a difference in the scores between water quality report and auditor report?

In [ ]:
%%sql
-- Grab the location_id and true_water_source_score columns from auditor_report.
SELECT
location_id,
true_water_source_score
FROM Auditor_report
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('SoRu34980', 1),
 ('AkRu08112', 3),
 ('AkLu02044', 0),
 ('AkHa00421', 3),
 ('SoRu35221', 0),
 ('HaAm16170', 1),
 ('AkRu04812', 3),
 ('AkRu08304', 3),
 ('AkRu05107', 2),
 ('AkRu05215', 3)]

In [ ]:
%%sql
-- Join the visits table to the auditor_report table. Make sure to grab subjective_quality_score, record_id and location_id.
SELECT
auditor_report.location_id AS audit_location,
auditor_report.true_water_source_score,
visits.location_id AS visit_location,
visits.record_id
FROM
auditor_report
JOIN
visits
ON auditor_report.location_id = visits.location_id
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('SoRu34980', 1, 'SoRu34980', 5185),
 ('AkRu08112', 3, 'AkRu08112', 59367),
 ('AkLu02044', 0, 'AkLu02044', 37379),
 ('AkHa00421', 3, 'AkHa00421', 51627),
 ('SoRu35221', 0, 'SoRu35221', 28758),
 ('HaAm16170', 1, 'HaAm16170', 31048),
 ('AkRu04812', 3, 'AkRu04812', 1513),
 ('AkRu08304', 3, 'AkRu08304', 1218),
 ('AkRu05107', 2, 'AkRu05107', 8322),
 ('AkRu05215', 3, 'AkRu05215', 21160)]

In [22]:
%%sql
-- retrieve the corresponding scores from the water_quality table.
SELECT
auditor_report.location_id AS audit_location,
visits.location_id AS visit_location,
visits.record_id,
auditor_report.true_water_source_score AS Auditor_score,
water_quality.subjective_quality_score AS Surveyor_Score
FROM
auditor_report
JOIN
visits
ON auditor_report.location_id = visits.location_id
JOIN water_quality ON
visits.record_id=water_quality.record_id
LIMIT 12;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
12 rows affected.

[('SoRu34980', 'SoRu34980', 5185, 1, 1),
 ('AkRu08112', 'AkRu08112', 59367, 3, 3),
 ('AkLu02044', 'AkLu02044', 37379, 0, 0),
 ('AkHa00421', 'AkHa00421', 51627, 3, 3),
 ('SoRu35221', 'SoRu35221', 28758, 0, 0),
 ('HaAm16170', 'HaAm16170', 31048, 1, 1),
 ('AkRu04812', 'AkRu04812', 1513, 3, 3),
 ('AkRu08304', 'AkRu08304', 1218, 3, 3),
 ('AkRu05107', 'AkRu05107', 8322, 2, 2),
 ('AkRu05215', 'AkRu05215', 21160, 3, 10),
 ('HaDe16541', 'HaDe16541', 13070, 2, 2),
 ('KiRu30351', 'KiRu30351', 54220, 9, 9)]

In [ ]:
%%sql
-- Check if the auditor's and exployees' scores agree.
SELECT
auditor_report.location_id AS audit_location,
visits.location_id AS visit_location,
visits.record_id,
auditor_report.true_water_source_score AS Auditor_score,
water_quality.subjective_quality_score AS Surveyor_Score
FROM
auditor_report
JOIN
visits
ON auditor_report.location_id = visits.location_id
JOIN water_quality ON
visits.record_id=water_quality.record_id
WHERE 
auditor_report.true_water_source_score =water_quality.subjective_quality_score
LIMIT 12;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
12 rows affected.

[('SoRu34980', 'SoRu34980', 5185, 1, 1),
 ('AkRu08112', 'AkRu08112', 59367, 3, 3),
 ('AkLu02044', 'AkLu02044', 37379, 0, 0),
 ('AkHa00421', 'AkHa00421', 51627, 3, 3),
 ('SoRu35221', 'SoRu35221', 28758, 0, 0),
 ('HaAm16170', 'HaAm16170', 31048, 1, 1),
 ('AkRu04812', 'AkRu04812', 1513, 3, 3),
 ('AkRu08304', 'AkRu08304', 1218, 3, 3),
 ('AkRu05107', 'AkRu05107', 8322, 2, 2),
 ('HaDe16541', 'HaDe16541', 13070, 2, 2),
 ('KiRu30351', 'KiRu30351', 54220, 9, 9),
 ('AmAm09813', 'AmAm09813', 191, 4, 4)]

In [26]:
%%sql
/*Some of the locations were visited multiple times, so these records are duplicated here. To fix it, we set visits.visit_count
= 1 in the WHERE clause. Make sure you reference the alias you used for visits in the join.*/
SELECT
auditor_report.location_id AS audit_location,
visits.location_id AS visit_location,
visits.record_id,
auditor_report.true_water_source_score AS Auditor_score,
water_quality.subjective_quality_score AS Surveyor_Score
FROM
auditor_report
JOIN
visits
ON auditor_report.location_id = visits.location_id
JOIN water_quality ON
visits.record_id=water_quality.record_id
WHERE 
auditor_report.true_water_source_score =water_quality.subjective_quality_score
AND visits.visit_count =1
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('SoRu34980', 'SoRu34980', 5185, 1, 1),
 ('AkRu08112', 'AkRu08112', 59367, 3, 3),
 ('AkLu02044', 'AkLu02044', 37379, 0, 0),
 ('AkHa00421', 'AkHa00421', 51627, 3, 3),
 ('SoRu35221', 'SoRu35221', 28758, 0, 0),
 ('HaAm16170', 'HaAm16170', 31048, 1, 1),
 ('AkRu04812', 'AkRu04812', 1513, 3, 3),
 ('AkRu08304', 'AkRu08304', 1218, 3, 3),
 ('AkRu05107', 'AkRu05107', 8322, 2, 2),
 ('HaDe16541', 'HaDe16541', 13070, 2, 2)]

In [31]:
%%sql
/*With the duplicates removed I now get 1518. What does this mean considering the auditor visited 1620 sites?
I think that is an excellent result. 1518/1620 = 94% of the records the auditor checked were correct!!
But that means that 102 records are incorrect.So let's look at those.You can do it by adding one character in the last query!*/
SELECT
auditor_report.location_id AS audit_location,
visits.location_id AS visit_location,
visits.record_id,
auditor_report.true_water_source_score AS Auditor_score,
water_quality.subjective_quality_score AS Surveyor_Score
FROM
auditor_report
JOIN
visits
ON auditor_report.location_id = visits.location_id
JOIN water_quality ON
visits.record_id=water_quality.record_id
WHERE 
auditor_report.true_water_source_score!=water_quality.subjective_quality_score
AND visits.visit_count =1
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkRu05215', 'AkRu05215', 21160, 3, 10),
 ('KiRu29290', 'KiRu29290', 7938, 3, 10),
 ('KiHa22748', 'KiHa22748', 43140, 9, 10),
 ('SoRu37841', 'SoRu37841', 18495, 6, 10),
 ('KiRu27884', 'KiRu27884', 33931, 1, 10),
 ('KiZu31170', 'KiZu31170', 17950, 9, 10),
 ('KiZu31370', 'KiZu31370', 36864, 3, 10),
 ('AkRu06495', 'AkRu06495', 45924, 2, 10),
 ('HaRu17528', 'HaRu17528', 30524, 1, 10),
 ('SoRu38331', 'SoRu38331', 13192, 3, 10)]

Since we used some of this data in our previous analyses, we need to make sure those results are still valid, now we know some of them are
incorrect. We didn't use the scores that much, but we relied a lot on the type_of_water_source, so let's check if there are any errors there

In [33]:
%%sql 
-- Checking for type of water source where the scores are incorrect
SELECT
auditor_report.location_id AS audit_location,
visits.location_id AS visit_location,
visits.record_id,
auditor_report.true_water_source_score AS Auditor_score,
water_quality.subjective_quality_score AS Surveyor_Score,
auditor_report.type_of_water_source AS Auditor_source,
water_source.type_of_water_source AS survey_source
FROM
auditor_report
JOIN
visits
ON auditor_report.location_id = visits.location_id
JOIN water_quality ON
visits.record_id=water_quality.record_id
JOIN  water_source ON
visits.source_id = water_source.source_id
WHERE 
auditor_report.true_water_source_score!=water_quality.subjective_quality_score
AND visits.visit_count =1
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkRu05215', 'AkRu05215', 21160, 3, 10, 'well', 'well'),
 ('KiRu29290', 'KiRu29290', 7938, 3, 10, 'shared_tap', 'shared_tap'),
 ('KiHa22748', 'KiHa22748', 43140, 9, 10, 'tap_in_home_broken', 'tap_in_home_broken'),
 ('SoRu37841', 'SoRu37841', 18495, 6, 10, 'shared_tap', 'shared_tap'),
 ('KiRu27884', 'KiRu27884', 33931, 1, 10, 'well', 'well'),
 ('KiZu31170', 'KiZu31170', 17950, 9, 10, 'tap_in_home_broken', 'tap_in_home_broken'),
 ('KiZu31370', 'KiZu31370', 36864, 3, 10, 'shared_tap', 'shared_tap'),
 ('AkRu06495', 'AkRu06495', 45924, 2, 10, 'well', 'well'),
 ('HaRu17528', 'HaRu17528', 30524, 1, 10, 'well', 'well'),
 ('SoRu38331', 'SoRu38331', 13192, 3, 10, 'shared_tap', 'shared_tap')]

So what I can see is that the types of sources look the same! So even though the scores are wrong, the integrity of the type_of_water_source
data we analysed last time is not affected.
Once you're done, remove the columns and JOIN statement for water_sources again.

3.LINKING RECORDS TO EMPLOYEES

Next up, let's look at where these errors may have come from. At some of the locations, employees assigned scores incorrectly, and those records
ended up in this results set.I think there are two reasons this can happen.
1. These workers are all humans and make mistakes so this is expected.
2. Unfortunately, the alternative is that someone assigned scores incorrectly on purpose!

In [36]:
%%sql
-- Retrieve the data of the employees who made the incorrect records
SELECT
visits.location_id AS visit_location,
visits.record_id,
auditor_report.true_water_source_score AS Auditor_score,
water_quality.subjective_quality_score AS Surveyor_Score,
employee.employee_name
FROM
visits
JOIN
auditor_report
ON auditor_report.location_id = visits.location_id
JOIN water_quality ON
visits.record_id=water_quality.record_id
JOIN employee ON
visits.assigned_employee_id = employee.assigned_employee_id
WHERE 
auditor_report.true_water_source_score!=water_quality.subjective_quality_score
AND visits.visit_count =1
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkRu05215', 21160, 3, 10, 'Rudo Imani'),
 ('KiRu29290', 7938, 3, 10, 'Bello Azibo'),
 ('KiHa22748', 43140, 9, 10, 'Bello Azibo'),
 ('SoRu37841', 18495, 6, 10, 'Rudo Imani'),
 ('KiRu27884', 33931, 1, 10, 'Bello Azibo'),
 ('KiZu31170', 17950, 9, 10, 'Zuriel Matembo'),
 ('KiZu31370', 36864, 3, 10, 'Yewande Ebele'),
 ('AkRu06495', 45924, 2, 10, 'Bello Azibo'),
 ('HaRu17528', 30524, 1, 10, 'Jengo Tumaini'),
 ('SoRu38331', 13192, 3, 10, 'Zuriel Matembo')]

Well this query is massive and complex, so maybe it is a good idea to save this as a CTE, so when we do more analysis, we can just call that CTE
like it was a table. Call it something like Incorrect_records. Once you are done, check if this query SELECT * FROM Incorrect_records, gets
the same table back.

In [40]:
%%sql
-- Creating a Common Table Expression
WITH Incorrect_records AS
( SELECT
visits.location_id AS visit_location,
visits.record_id,
auditor_report.true_water_source_score AS Auditor_score,
water_quality.subjective_quality_score AS Surveyor_Score,
employee.employee_name
FROM
visits
JOIN
auditor_report
ON auditor_report.location_id = visits.location_id
JOIN water_quality ON
visits.record_id=water_quality.record_id
JOIN employee ON
visits.assigned_employee_id = employee.assigned_employee_id
WHERE 
auditor_report.true_water_source_score!=water_quality.subjective_quality_score
AND visits.visit_count =1
)
SELECT *
FROM Incorrect_Records
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkRu05215', 21160, 3, 10, 'Rudo Imani'),
 ('KiRu29290', 7938, 3, 10, 'Bello Azibo'),
 ('KiHa22748', 43140, 9, 10, 'Bello Azibo'),
 ('SoRu37841', 18495, 6, 10, 'Rudo Imani'),
 ('KiRu27884', 33931, 1, 10, 'Bello Azibo'),
 ('KiZu31170', 17950, 9, 10, 'Zuriel Matembo'),
 ('KiZu31370', 36864, 3, 10, 'Yewande Ebele'),
 ('AkRu06495', 45924, 2, 10, 'Bello Azibo'),
 ('HaRu17528', 30524, 1, 10, 'Jengo Tumaini'),
 ('SoRu38331', 13192, 3, 10, 'Zuriel Matembo')]

In [ ]:
%%sql
-- Get a unique list of employees from this table.
WITH Incorrect_records AS
( SELECT
visits.location_id AS visit_location,
visits.record_id,
auditor_report.true_water_source_score AS Auditor_score,
water_quality.subjective_quality_score AS Surveyor_Score,
employee.employee_name
FROM
visits
JOIN
auditor_report
ON auditor_report.location_id = visits.location_id
JOIN water_quality ON
visits.record_id=water_quality.record_id
JOIN employee ON
visits.assigned_employee_id = employee.assigned_employee_id
WHERE 
auditor_report.true_water_source_score!=water_quality.subjective_quality_score
AND visits.visit_count =1
)
SELECT
employee_name,
COUNT(employee_name) AS Number_of_mistakes
FROM Incorrect_records
GROUP BY employee_name
ORDER BY Number_of_mistakes DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
17 rows affected.

[('Bello Azibo', 26),
 ('Malachi Mavuso', 21),
 ('Zuriel Matembo', 17),
 ('Lalitha Kaburi', 7),
 ('Rudo Imani', 5),
 ('Farai Nia', 4),
 ('Enitan Zuri', 4),
 ('Yewande Ebele', 3),
 ('Jengo Tumaini', 3),
 ('Makena Thabo', 3),
 ('Gamba Shani', 3),
 ('Thandiwe Kito', 1),
 ('Pili Zola', 1),
 ('Usafi Ayo', 1),
 ('Deka Osumare', 1),
 ('Ona Sefu', 1),
 ('Xola Uzuri', 1)]

4.GATHERING SOME EVIDENCE

How would we go about finding out if any of our employees are corrupt?  
Find all of the employees who have an above-average number of mistakes

In [8]:
%%sql
DROP VIEW IF EXISTS Incorrect_records;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [ ]:
%%sql
-- 1.Replace WITH with CREATE VIEW 
CREATE VIEW Incorrect_records AS (
SELECT
auditor_report.location_id,
visits.record_id,
employee.employee_name,
auditor_report.true_water_source_score AS auditor_score,
wq.subjective_quality_score AS surveyor_score,
auditor_report.statements AS statements
FROM
auditor_report
JOIN
visits
ON auditor_report.location_id = visits.location_id
JOIN
water_quality AS wq
ON visits.record_id = wq.record_id
JOIN
employee
ON employee.assigned_employee_id = visits.assigned_employee_id
WHERE
visits.visit_count =1
AND auditor_report.true_water_source_score != wq.subjective_quality_score);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [ ]:
%%sql
-- 2.Calculate the number of mistakes each employee made
WITH error_count AS (
SELECT
employee_name,
COUNT(employee_name) AS number_of_mistakes
FROM
Incorrect_records
GROUP BY
employee_name
ORDER BY Number_of_mistakes DESC)
SELECT * 
FROM error_count;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
17 rows affected.

[('Bello Azibo', 26),
 ('Malachi Mavuso', 21),
 ('Zuriel Matembo', 17),
 ('Lalitha Kaburi', 7),
 ('Rudo Imani', 5),
 ('Farai Nia', 4),
 ('Enitan Zuri', 4),
 ('Yewande Ebele', 3),
 ('Jengo Tumaini', 3),
 ('Makena Thabo', 3),
 ('Gamba Shani', 3),
 ('Thandiwe Kito', 1),
 ('Pili Zola', 1),
 ('Usafi Ayo', 1),
 ('Deka Osumare', 1),
 ('Ona Sefu', 1),
 ('Xola Uzuri', 1)]

In [ ]:
%%sql
-- 3.Now calculate the average of the number_of_mistakes in error_count. You should get a single value.
 WITH error_count AS (
    SELECT
    employee_name,
    COUNT(employee_name) AS number_of_mistakes
    FROM
    Incorrect_records
    GROUP BY
    employee_name
)
SELECT
AVG(Number_of_mistakes) AS avg_error_count_per_empl
FROM
error_count;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('6.0000'),)]

In [3]:
%%sql
/*To find the employees who made more mistakes than the average person, we need the employee's names, the number of mistakes each one
made, and filter the employees with an above-average number of mistakes.*/
 WITH error_count AS (
    SELECT
    employee_name,
    COUNT(employee_name) AS number_of_mistakes
    FROM
    Incorrect_records
    GROUP BY
    employee_name
)
SELECT
Employee_name,
AVG(Number_of_mistakes) AS avg_error_count_per_empl
FROM
error_count
WHERE
Number_of_mistakes > (SELECT
                    AVG(Number_of_mistakes) AS avg_error_count_per_empl
                    FROM 
                    error_count)
GROUP BY Employee_name
ORDER BY Avg_error_count_per_empl DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
4 rows affected.

[('Bello Azibo', Decimal('26.0000')),
 ('Malachi Mavuso', Decimal('21.0000')),
 ('Zuriel Matembo', Decimal('17.0000')),
 ('Lalitha Kaburi', Decimal('7.0000'))]

In [5]:
%%sql
-- Create View Error_count
CREATE VIEW error_count AS
SELECT
    employee_name,
    COUNT(employee_name) AS number_of_mistakes,
    AVG(COUNT(employee_name)) OVER () AS avg_error_count_per_empl
FROM
    Incorrect_records
GROUP BY
    employee_name;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [11]:
%%sql
/*We should look at the Incorrect_records table again, and isolate all of the records these four employees gathered. We should also look at the
statements for these records to look for patterns.
First, convert the suspect_list to a CTE, so we can use it to filter the records from these four employees. Make sure you get the names of the
four "suspects", and their mistake count as a result, using SELECT employee_name FROM suspect_list.*/

WITH 
    Incorrect_records 
AS 
    (SELECT
        auditor_report.location_id,
        visits.record_id,
        employee.employee_name,
        auditor_report.true_water_source_score AS auditor_score,
        water_quality.subjective_quality_score AS surveyor_score,
        auditor_report.statements
    FROM
        auditor_report
    JOIN
        visits
    ON
        auditor_report.location_id = visits.location_id
    JOIN
        water_quality
    ON
        visits.record_id = water_quality.record_id
    JOIN
        employee
    ON
        employee.assigned_employee_id = visits.assigned_employee_id
    WHERE
        auditor_report.true_water_source_score != water_quality.subjective_quality_score
    AND
        visits.visit_count = 1),
    error_count
AS
    (select 
        employee_name, count(employee_name) as number_of_mistakes
    FROM
        Incorrect_records
    GROUP BY
        employee_name),
    suspect_list
as
        (SELECT
            employee_name, number_of_mistakes
        FROM
            error_count
        WHERE
            number_of_mistakes > (
                select 
                    AVG(number_of_mistakes) AS Avg 
                from 
                    error_count)
        ORDER BY
            number_of_mistakes DESC)
SELECT
    employee_name, location_id, statements
FROM
    Incorrect_records
WHERE
    employee_name
IN
    (select employee_name FROM suspect_list)
    LIMIT 15;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
15 rows affected.

[('Bello Azibo', 'KiRu29290', 'A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.'),
 ('Bello Azibo', 'KiHa22748', "A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system."),
 ('Bello Azibo', 'KiRu27884', "A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community."),
 ('Zuriel Matembo', 'KiZu31170', 'A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","'),
 ('Bello Azibo', 'AkRu06495', 'A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","'),
 ('Zuriel Matembo', 'SoRu38331', 'An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.'),
 ('Malachi Mavuso', 'AmAm09607', 'Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.'),
 ('Zuriel Matembo', 'AkHa00314', "A street vendor's sales suffer from time spent waiting, her concern for the water's quality affecting her products."),
 ('Malachi Mavuso', 'KiRu26598', "A teenager's dreams are tempered by reality, her future threatened by the corrupt practices she sees around her."),
 ('Bello Azibo', 'KiIs23853', "Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception."),
 ('Lalitha Kaburi', 'KiIs24083', "A fisherman's anger boils beneath the surface, his livelihood threatened by the corrupt who tamper with water."),
 ('Malachi Mavuso', 'AmAm09631', 'An elderly man lamented the endless queue, recalling times when water was abundant and clean.","'),
 ('Zuriel Matembo', 'KiRu30343', "A university student's studies suffer from hours in line, dreams clouded by the daily reality of dirty water."),
 ('Malachi Mavuso', 'AkRu04116', "A student's ambition is fueled by the daily water struggle, his determination to overcome evident in the queue."),
 ('Malachi Mavuso', 'AmPw12272', "A subsistence farmer's worry for his crops extends to the queue, the struggle for water a shared community burden.")]

In [12]:
%%sql
/*Firstly, let's add the statements column to the Incorrect_records view. Then pull up all of the records where the employee_name is in the
suspect list. HINT: Use SELECT employee_name FROM suspect_list as a subquery in WHERE.*/
WITH
    Incorrect_records AS ( 
        SELECT
            auditor_report.location_id,
            visits.record_id,
            employee.employee_name,
            auditor_report.true_water_source_score AS auditor_score,
            water_quality.subjective_quality_score AS surveyor_score,
            auditor_report.statements
        FROM
            auditor_report
        JOIN
            visits ON auditor_report.location_id = visits.location_id
        JOIN
            water_quality ON visits.record_id = water_quality.record_id
        JOIN
            employee ON employee.assigned_employee_id = visits.assigned_employee_id
        WHERE
            auditor_report.true_water_source_score != water_quality.subjective_quality_score
            AND visits.visit_count = 1
    ),
    error_count AS (
        SELECT
            employee_name,
            COUNT(employee_name) AS number_of_mistakes
        FROM
            Incorrect_records -- Now Incorrect_records is defined and accessible
        GROUP BY
            employee_name
    ),
    suspect_list AS (
        SELECT
            employee_name,
            number_of_mistakes
        FROM
            error_count
        WHERE
            number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count)
    )
SELECT
    ir.employee_name,
    ir.location_id,
    ir.statements
FROM
    Incorrect_records AS ir -- Use alias for clarity
JOIN
    suspect_list AS sl ON ir.employee_name = sl.employee_name
    LIMIT 15;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
15 rows affected.

[('Bello Azibo', 'AmRu14842', "An elderly woman's weary eyes reflect the toll of daily hours spent in the queue, her thoughts on family back home."),
 ('Bello Azibo', 'HaYa21395', "A university student's studies suffer from hours in line, dreams clouded by the daily reality of dirty water."),
 ('Bello Azibo', 'AkRu05741', 'An air of mistrust surrounded the official, as villagers spoke of laziness and hints of corruption. The mention of cash passing discreetly only deepened their concerns.'),
 ('Bello Azibo', 'AmRu14887', 'Villagers expressed their discomfort with an official who displayed a haughty demeanor and negligence. The mention of cash transactions deepened their growing sense of unease.'),
 ('Bello Azibo', 'KiMr24919', "Suspicion and unease colored the villagers' accounts of an official's haughty behavior and potential corruption. The mention of cash changing hands added to their apprehension."),
 ('Bello Azibo', 'KiRu29639', "An unsettling atmosphere prevailed as villagers shared stories of an official's arrogance and perceived corruption. The mention of cash exchanges only intensified their concerns."),
 ('Bello Azibo', 'KiAm22092', "A mother-to-be's gentle waiting in line is filled with hope and concern, the water's quality a looming worry."),
 ('Bello Azibo', 'AkLu02500', "A tour guide's enthusiasm is dampened by the water situation, his own wait in line a daily challenge."),
 ('Bello Azibo', 'AkRu03848', "A local tailor's creativity is stifled by frustration, his work impacted by the corruption that taints the water."),
 ('Bello Azibo', 'AkRu04508', 'An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.'),
 ('Bello Azibo', 'SoRu36708', "A local mason's strong back is bent by the wait for water, his concerns for quality reflecting a broader challenge."),
 ('Bello Azibo', 'SoKo33333', "A community volunteer's dedication is tested by bitterness, her efforts often thwarted by corrupt officials."),
 ('Bello Azibo', 'KiZu31100', "A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system."),
 ('Bello Azibo', 'AmRu14364', "A local musician's songs of joy are replaced with melodies of despair, inspired by the corrupt who control the water."),
 ('Bello Azibo', 'KiRu27065', 'Villagers expressed their discomfort with an official who displayed a haughty demeanor and negligence. The mention of cash transactions deepened their growing sense of unease.')]

In [13]:
%%sql
/*Filter the records that refer to "cash".
Check if there are any employees in the Incorrect_records table with statements mentioning "cash" that are not in our suspect list. This should
be as simple as adding one word.*/
WITH
    error_count
AS
    (select 
        employee_name, count(employee_name) AS number_of_mistakes
    FROM
        Incorrect_records
    GROUP BY
        employee_name),
    suspect_list
AS
        (select 
            employee_name, number_of_mistakes
        FROM 
            error_count
        WHERE
            number_of_mistakes > (
                select 
                    AVG(number_of_mistakes) AS Avg 
                FROM
                    error_count)
        ORDER BY
            number_of_mistakes DESC)
SELECT
    employee_name, location_id, statements
FROM
    Incorrect_records
WHERE
    employee_name
IN
    (select employee_name from suspect_list)
AND
    statements like '%cash%';

 * mysql+pymysql://root:***@localhost:3306/md_water_services
19 rows affected.

[('Zuriel Matembo', 'SoRu38331', 'An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.'),
 ('Malachi Mavuso', 'AmAm09607', 'Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.'),
 ('Bello Azibo', 'KiIs23853', "Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception."),
 ('Bello Azibo', 'HaSe21323', 'Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.'),
 ('Zuriel Matembo', 'AkRu05880', "Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The allusion to cash changing hands deepened their skepticism."),
 ('Bello Azibo', 'KiRu27065', 'Villagers expressed their discomfort with an official who displayed a haughty demeanor and negligence. The mention of cash transactions deepened their growing sense of unease.'),
 ('Malachi Mavuso', 'KiRu25347', 'Villagers expressed their discontent with an official who appeared dismissive and neglectful. The mention of cash changing hands added to their growing sense of distrust.'),
 ('Zuriel Matembo', 'SoIl32575', 'Villagers recounted unsettling encounters with an official known for their arrogance and avoidance of responsibilities. The mention of cash changing hands added to their apprehension and distrust.'),
 ('Bello Azibo', 'AkRu04508', 'An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.'),
 ('Lalitha Kaburi', 'AkRu07310', 'Villagers spoke of their unsettling encounters with an official who seemed indifferent and uninterested, hinting at potential improprieties involving cash exchanges.'),
 ('Bello Azibo', 'KiRu29639', "An unsettling atmosphere prevailed as villagers shared stories of an official's arrogance and perceived corruption. The mention of cash exchanges only intensified their concerns."),
 ('Lalitha Kaburi', 'KiRu29329', "Suspicion colored villagers' descriptions of an official's aloof demeanor and apparent laziness. The reference to cash transactions cast doubt on their motives."),
 ('Bello Azibo', 'KiMr24919', "Suspicion and unease colored the villagers' accounts of an official's haughty behavior and potential corruption. The mention of cash changing hands added to their apprehension."),
 ('Zuriel Matembo', 'HaSe20888', "Suspicion and unease colored the villagers' accounts of an official's haughty behavior and potential corruption. The mention of cash changing hands added to their apprehension."),
 ('Bello Azibo', 'AmRu14887', 'Villagers expressed their discomfort with an official who displayed a haughty demeanor and negligence. The mention of cash transactions deepened their growing sense of unease.'),
 ('Zuriel Matembo', 'HaRu20146', "An air of mistrust hung heavy as villagers described an official's aloof behavior and potential impropriety. The whisper of cash exchanges only fueled their apprehension."),
 ('Bello Azibo', 'AkRu05741', 'An air of mistrust surrounded the official, as villagers spoke of laziness and hints of corruption. The mention of cash passing discreetly only deepened their concerns.'),
 ('Malachi Mavuso', 'AmRu15719', "Suspicion and unease colored the villagers' accounts of an official's haughty behavior and potential corruption. The mention of cash changing hands added to their apprehension."),
 ('Malachi Mavuso', 'AmAm09956', 'An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.')]